<template>
    <h1 class="pink fonts">
        自己満デッキ紹介
    </h1>
    <m1 class="fonts">
        　Blog第二回はマスターデュエルです。音ゲーはスマホ録画が思ったより重くてできなく、親指でスマホを持ってやっているため映像が取れないため悩んでいます。もし良い録画方法があったら教えてほしいです。<br/>とりあえず本題に入ります。
        <br/>今回はある程度前から遊んでいるMasterDuelの話です。<br/>今日のアップデートで、ホルスとかS:Pリトルナイトとかが追加されたためティアラメンツとか幻影とか今まで通りのスネークアイが流行りそうで怖いです。<br/>先行が取れたら勝てると思うのですがいかんせんコイントスの勝率が低いです。
        <img alt="anzu logo" class="blog-full" src="@/assets/deck-lis-pure.png" />
        ピュアリィにFAとゴーストリックと暗黒界を混ぜたデッキです。<br/>
        できるだけピュアリィは不純物を混ぜずに40枚にしたほうがいいのはわかっているのですが、ピュアリィ速攻魔法の手札コストが確保しきれず負けた試合が何度かあったのでやむなく入れています。<br/>
        (ただ、暗黒界を入れる前でもピュアリィの３枚めくりはめくれないときはめくれません)<br/>
        ピュアリィのなつき度が足りないのかもしれません。<br/>
        ピュアリィの最終目標の盤面といえばノアールですが、このデッキは相手ターンにノアールを出すことになります。<br/>
        ・ルート1(メイン)<br/>
        　このデッキはとにかくレベル1を二体用意することが大切です。もしかしたらドロール＆ロックバードを採用すべきかもしれませんが、ラビュとかスネークアイとかが多いので今の環境ではあまり強くないので入れませんでした。<br/>
        1.Lv1 二体でX召喚 ゴーストリック・デュラハン<br/>
        2.ゴーストリック・デュラハンの上にゴーストリックの堕天使(1)をX召喚<br/>
        3.ゴーストリックの駄天使(1)の効果でゴーストリックショットをサーチ<br/>
        4.ショットでデュラハンを蘇生<br/>
        5.ゴーストリック・デュラハンの上にゴーストリックの堕天使(2)をX召喚<br/>
        6.ゴーストリックの駄天使(2)の効果でゴーストリックリフォームをサーチ<br/>
        7.ゴーストリックの駄天使(2)の効果でリフォームをX素材にする<br/>
        8.ゴーストリックの駄天使(2)の上にエクシーズ・アーマー・フォートレスをX召喚<br/>
        9.エクシーズ・アーマー・フォートレスでアーマード・エクシーズとフルアーマード・エクシーズをサーチ<br/>
        10.アーマード・エクシーズでエクシーズ・アーマー・フォートレスにデュラハンを装備<br/>
        11.エクシーズ・アーマー・フォートレスの上にFA-ダーク・ナイト・ランサーをX召喚<br/>
        12.FA-ダーク・ナイト・ランサーでアーマード・エクシーズを回収<br/>
        13.リフォームでゴーストリックの駄天使(1)の上にデュラハンをX召喚<br/>
        14.デュラハンの上にゴーストリックの駄天使(3)をX召喚<br/>
        15.ゴーストリックの駄天使(3)の効果でゴーストリックリフォームをサーチ<br/>
        16.何かしらの方法でリフォームを墓地に落とす。(ピュアリィ速攻魔法など)<br/>
        17.フルアーマード・エクシーズをセット<br/>
        -------相手ターン-------<br/>
        18.墓地のリフォーム効果でゴーストリックの駄天使(3)の上にゴーストリック・サキュバスをX召喚<br/>
        19.フルアーマード・エクシーズでゴーストリック・サキュバスの上にエクスピュアリィ・ノアールをX召喚<br/>
        手順を書いたらすごく長くなってしまいました(許して)<br/>
        <br/>
      代わりにクリーパーの素材でもおいておきます。
      <img alt="" class="blog-full" src="@/assets/creese.png" width="64" height="130" />
    </m1>
    <d1 class="pink fonts">
        <br/><br/><br/>小鳥あんずでした～
    </d1>
</template>

<style>
h1 {
    font-size: 3rem;
    position: relative;
    top: -10px;
    margin: 0 auto 2rem;
    text-align: center;
  }

m1 {
  padding-top:5px;
  margin:rem;
  position: relative;
  margin-bottom: 2rem;
  font-size: 25px;
  color:white;
  text-decoration: none;
  text-align: center;
}

d1 {
    font-size: 1rem;
    position: relative;
    top: -10px;
    margin: 0 auto 2rem;
    text-align: center;
  }

</style>